## Data

In [1]:
import pandas as pd

In [2]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [3]:
student_df = pd.DataFrame(students)

## Sütun Ekleme

In [4]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

* Dictionary veri tipinde eleman eklemek ile çok benziyor:

In [5]:
d = {"İlayda":95}

In [6]:
d["Burak"] = 90

In [3]:
d

{'İlayda': 95, 'Burak': 90}

In [18]:
student_df["full_name"] = student_df["name"] + " " + student_df["last_name"]

In [19]:
student_df

     name last_name  age  student_number       full_name
0  Finley     Brown   23             101    Finley Brown
1  Andrew   Bradley   21             403  Andrew Bradley
2   Blake    Hughes   34             202    Blake Hughes
3   Denis     James   24               1     Denis James

## Sütun Silmek

In [7]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [8]:
b = student_df.drop(columns=["name","last_name"])

In [18]:
b

   age  student_number
0   23             101
1   21             403
2   34             202
3   24               1

In [16]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [9]:
student_df.drop(columns=["name","last_name"], inplace=True)

In [10]:
student_df

   age  student_number
0   23             101
1   21             403
2   34             202
3   24               1

In [19]:
# b.at(0,"age") = 100

SyntaxError: can't assign to function call (<ipython-input-19-7ae7c2eb11a1>, line 1)